In [1]:
import numpy as np

In [5]:
np.random.seed(1)
x1 = np.random.randint(10, size=(10))
print(x1)

[5 8 9 5 0 0 1 7 6 9]

In [7]:
x2 = np.random.randint(10, size = (2,5))
x2

array([[2, 4, 5, 2, 4],
       [2, 4, 7, 7, 9]])

In [8]:
x3 = np.arange(10)
x3

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [12]:
x4 = np.linspace(0, 1.4, 10)
x4

array([ 0.        ,  0.15555556,  0.31111111,  0.46666667,  0.62222222,
        0.77777778,  0.93333333,  1.08888889,  1.24444444,  1.4       ])

In [13]:
import pandas as pd

In [20]:
np.random.seed(1)
d1 = pd.DataFrame({'A':np.random.randint(10, size= (10)), 'B':np.linspace(0, 2, 10)})
d1

   A         B
0  5  0.000000
1  8  0.222222
2  9  0.444444
3  5  0.666667
4  0  0.888889
5  0  1.111111
6  1  1.333333
7  7  1.555556
8  6  1.777778
9  9  2.000000

In [23]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
A    10 non-null int32
B    10 non-null float64
dtypes: float64(1), int32(1)
memory usage: 160.0 bytes

In [28]:
d1.sort_values(by=['A'], ascending=True, inplace=False)

   A         B
4  0  0.888889
5  0  1.111111
6  1  1.333333
0  5  0.000000
3  5  0.666667
8  6  1.777778
7  7  1.555556
1  8  0.222222
2  9  0.444444
9  9  2.000000

In [30]:
#duplicate dataset
d2 = pd.DataFrame({'A':['One']*3 + ['Two']*3, 'B':np.random.randint(6, size =(6))})
d2

     A  B
0  One  2
1  One  4
2  One  5
3  Two  2
4  Two  4
5  Two  3

In [32]:
d2.sort_values('A')

     A  B
0  One  2
1  One  4
2  One  5
3  Two  2
4  Two  4
5  Two  3

In [35]:
d2.drop_duplicates('A')
d2

     A  B
0  One  2
1  One  4
2  One  5
3  Two  2
4  Two  4
5  Two  3

In [36]:
d2.drop_duplicates(subset='A')
d2

     A  B
0  One  2
1  One  4
2  One  5
3  Two  2
4  Two  4
5  Two  3

In [37]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami','corned beef', 'Bacon', 'pastrami', 'honey ham','nova lox'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [39]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [40]:
meat_to_animal['bacon']

'pig'

In [46]:
def meat_2_animal(d):
    return meat_to_animal[d]

data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [48]:
data.assign(ounces10 = data['ounces']*10)

          food  ounces  animal  ounces10
0        bacon     4.0     pig      40.0
1  pulled pork     3.0     pig      30.0
2        bacon    12.0     pig     120.0
3     Pastrami     6.0     cow      60.0
4  corned beef     7.5     cow      75.0
5        Bacon     8.0     pig      80.0
6     pastrami     3.0     cow      30.0
7    honey ham     5.0     pig      50.0
8     nova lox     6.0  salmon      60.0

In [53]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace(-999, np.NaN, inplace=True)

In [56]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [58]:
data.replace([-999, -1000], np.NaN, inplace=False)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [60]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [65]:
data.rename(index={'Ohio':'SanF'}, columns={'one':'one_t', 'two':'two_t'}, inplace=False)

          one_t  two_t  three  four
SanF          0      1      2     3
Colorado      4      5      6     7
New York      8      9     10    11

In [68]:
data.rename(index=str.upper, columns=str.title, inplace=False)

          One_T  Two_T  Three  Four
SANF          0      1      2     3
COLORADO      4      5      6     7
NEW YORK      8      9     10    11

Bins

In [69]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [70]:
bins = [18, 25, 35, 60, 100]

In [71]:
cats = pd.cut(ages, bins)

In [74]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [76]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [78]:
bin_names = ['Youth', 'YoungAdult', 'MiddleAge', 'Senior']
new_cat = pd.cut(ages, bins, labels=bin_names)
new_cat

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAge, MiddleAge, YoungAdult]
Length: 12
Categories (4, object): [MiddleAge < Senior < YoungAdult < Youth]

In [79]:
pd.value_counts(new_cat)

Youth         5
YoungAdult    3
MiddleAge     3
Senior        1
dtype: int64

In [80]:
data = pd.DataFrame({'group': ['a', 'a', 'a', 'b','b', 'b', 'c', 'c','c'],
                 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

  group  ounces
0     a     4.0
1     a     3.0
2     a    12.0
3     b     6.0
4     b     7.5
5     b     8.0
6     c     3.0
7     c     5.0
8     c     6.0

In [82]:
data.groupby('group').agg(['mean','min','max'])

         ounces
           mean  min   max
group
a      6.333333  3.0  12.0
b      7.166667  6.0   8.0
c      4.666667  3.0   6.0